Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles
This enum represents the values that custom handles tags of RebarConstrainedHandle of Rebar Free Form Surface Distribution has.
The tag of a Autodesk::Revit::DB::Structure::RebarHandleType::CustomHandle RebarConstrainedHandle
can be obtained by calling the Autodesk::Revit::DB::Structure::RebarConstrainedHandle::GetCustomHandleTag()
Since:
2026
Since:
2026

Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles.EndSurface
Tag for handle representing the End Surface.

Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles.StartSurface
Tag for handle representing the Start Surface.

Autodesk.Revit.DB.Structure.SurfaceDistributionRebarHandles.HostSurface
Tag for handle representing the Host Surface.